/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   write_color.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mypark <mypark@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/03 17:50:06 by mypark            #+#    #+#             */
/*   Updated: 2022/05/11 17:23:56 by mypark           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include "vec3.h"

// [0,1] 로 되어있는 rgb 값을 각각 [0,255]에 맵핑 해서 출력.
void    write_color(t_color3 *pixel_color)
{
    printf("%d %d %d\n", (int)(255.999 * pixel_color->x),   // 왜 255.999?
                        (int)(255.999 * pixel_color->y),
                        (int)(255.999 * pixel_color->z));
}